In [1]:
person = {
    'first':['Vaibhav','Sam','John'],
    'last' : ['Nath','Ham','Doe'],
    'email' : ['Vaibhav.nath@email.com', 'Sam.Ham@email.com','John.Doe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(person)
df

     first  last                   email
0  Vaibhav  Nath  Vaibhav.nath@email.com
1      Sam   Ham       Sam.Ham@email.com
2     John   Doe      John.Doe@email.com

In [4]:
df['first'] + ' ' +df['last']     #combine 2 columns together.

0    Vaibhav Nath
1         Sam Ham
2        John Doe
dtype: object

In [5]:
df['full_name'] = df['first'] + ' ' + df['last']    #assign a name to combined columns and create a new column.

In [6]:
df

     first  last                   email     full_name
0  Vaibhav  Nath  Vaibhav.nath@email.com  Vaibhav Nath
1      Sam   Ham       Sam.Ham@email.com       Sam Ham
2     John   Doe      John.Doe@email.com      John Doe

In [7]:
df.drop(columns=['first','last'])          #removes the specified columns.

                    email     full_name
0  Vaibhav.nath@email.com  Vaibhav Nath
1       Sam.Ham@email.com       Sam Ham
2      John.Doe@email.com      John Doe

In [8]:
df.drop(columns=['first','last'],inplace=True)       #permanently remove columns from dataframe.

In [9]:
df

                    email     full_name
0  Vaibhav.nath@email.com  Vaibhav Nath
1       Sam.Ham@email.com       Sam Ham
2      John.Doe@email.com      John Doe

In [10]:
df['full_name'].str.split(' ',expand=True)      #split a column into 2 columns.

         0     1
0  Vaibhav  Nath
1      Sam   Ham
2     John   Doe

In [11]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)    #rename the split columns and add in dataframe. 
df

                    email     full_name    first  last
0  Vaibhav.nath@email.com  Vaibhav Nath  Vaibhav  Nath
1       Sam.Ham@email.com       Sam Ham      Sam   Ham
2      John.Doe@email.com      John Doe     John   Doe

In [12]:
df.append({              #add a row to dataFrame
    'first':'Tony'
},
ignore_index=True
)

                    email     full_name    first  last
0  Vaibhav.nath@email.com  Vaibhav Nath  Vaibhav  Nath
1       Sam.Ham@email.com       Sam Ham      Sam   Ham
2      John.Doe@email.com      John Doe     John   Doe
3                     NaN           NaN     Tony   NaN

In [13]:
person = {
    'first':['Tony','Steve'],
    'last' : ['Stark','Roger'],
    'email' : ['TonyStark@email.com', 'SteveRoger@email.com']
}

In [14]:
df2=pd.DataFrame(person)
df2

   first   last                 email
0   Tony  Stark   TonyStark@email.com
1  Steve  Roger  SteveRoger@email.com

In [15]:
df.append(df2,ignore_index=True)       #add 2 dataframes together.

                    email     full_name    first   last
0  Vaibhav.nath@email.com  Vaibhav Nath  Vaibhav   Nath
1       Sam.Ham@email.com       Sam Ham      Sam    Ham
2      John.Doe@email.com      John Doe     John    Doe
3     TonyStark@email.com           NaN     Tony  Stark
4    SteveRoger@email.com           NaN    Steve  Roger

In [16]:
df= df.append(df2,ignore_index=True)
df

                    email     full_name    first   last
0  Vaibhav.nath@email.com  Vaibhav Nath  Vaibhav   Nath
1       Sam.Ham@email.com       Sam Ham      Sam    Ham
2      John.Doe@email.com      John Doe     John    Doe
3     TonyStark@email.com           NaN     Tony  Stark
4    SteveRoger@email.com           NaN    Steve  Roger

In [17]:
df=df.drop(index=4)              #remove row from dataframe
df

                    email     full_name    first   last
0  Vaibhav.nath@email.com  Vaibhav Nath  Vaibhav   Nath
1       Sam.Ham@email.com       Sam Ham      Sam    Ham
2      John.Doe@email.com      John Doe     John    Doe
3     TonyStark@email.com           NaN     Tony  Stark

In [18]:
filt=df['last']== 'Doe'
df=df.drop(index=df[filt].index)      #remove all rows with specific column value.
df

                    email     full_name    first   last
0  Vaibhav.nath@email.com  Vaibhav Nath  Vaibhav   Nath
1       Sam.Ham@email.com       Sam Ham      Sam    Ham
3     TonyStark@email.com           NaN     Tony  Stark